

/*ヘッダファイルの読み込み*/
#include"stdint.h"

#ifndef PORT_H_											//対応ファイルで一度も読み込まれていない場合以下を定義

	#define PORT_H_										//読み込んだことを表す


	enum {												//GPIOの子番号の列挙型
		P0_0, P0_1, P0_2, P0_3,
		P0_4, P0_5, P0_6, P0_7,
		P0_8, P0_9, P0_10, P0_11,
		P0_12, P0_13, P0_14, P0_15,

		P1_0, P1_1, P1_2, P1_3,
		P1_4, P1_5, P1_6, P1_7,
		P1_8, P1_9, P1_10, P1_11,
		P1_12, P1_13, P1_14, P1_15,

		P2_0, P2_1, P2_2, P2_3,
		P2_4, P2_5, P2_6, P2_7,
		P2_8, P2_9, P2_10, P2_11,
		P2_12, P2_13, P2_14, P2_15,

		P3_0, P3_1, P3_2, P3_3,
		P3_4, P3_5
	};

	enum{												//ピンの入出力の列挙型
		IN,												//入力(=0)
		OUT												//出力(=1)
	};

	/*関数のプロトタイプ宣言*/
	void LedDisplay(uint8_t *led);

#endif /* PORT_H_ */
